In [1]:
import pandas as pd

Creating a Pandas Series

In [23]:
series=pd.Series([10,20,30,40,50])
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

Creating a DataFrame from a Dictionary

In [25]:
data={'Name':['reham','basmala','alaa','rana','habiba'],
      'Age':[20,18,21,22,19],
      'City':['tiwan','new york','cairo','los angeles','gaza']}
df=pd.DataFrame(data)
df

      Name  Age         City
0    reham   20        tiwan
1  basmala   18     new york
2     alaa   21        cairo
3     rana   22  los angeles
4   habiba   19         gaza

Viewing the First Few Rows

In [27]:
df.head()

      Name  Age         City
0    reham   20        tiwan
1  basmala   18     new york
2     alaa   21        cairo
3     rana   22  los angeles
4   habiba   19         gaza

Getting DataFrame Information

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

Describing Statistical Information

In [29]:
df.describe()

             Age
count   5.000000
mean   20.000000
std     1.581139
min    18.000000
25%    19.000000
50%    20.000000
75%    21.000000
max    22.000000

Selecting Columns

In [30]:
print(df['Name'])

0      reham
1    basmala
2       alaa
3       rana
4     habiba
Name: Name, dtype: object

Filtering Rows Based on Condition

In [31]:
filterd_df=df[df['Age']>18]
print(filterd_df)

     Name  Age         City
0   reham   20        tiwan
2    alaa   21        cairo
3    rana   22  los angeles
4  habiba   19         gaza

 Selecting Data Using `.loc` in Pandas

In [32]:
selected_data=df.loc[0:1,"Name":"City"]
print(selected_data)

      Name  Age      City
0    reham   20     tiwan
1  basmala   18  new york


Selecting Data Using `.iloc` in Pandas

In [33]:
selected_data=df.iloc[0:2,0:3]
print(selected_data)

      Name  Age      City
0    reham   20     tiwan
1  basmala   18  new york

Adding a New Column

In [34]:
df['Salary']=[10000,20000,30000,45000,15000]
df

      Name  Age         City  Salary
0    reham   20        tiwan   10000
1  basmala   18     new york   20000
2     alaa   21        cairo   30000
3     rana   22  los angeles   45000
4   habiba   19         gaza   15000

Updating Column Values

In [35]:
df['Age']= df['Age'] + 1
df

      Name  Age         City  Salary
0    reham   21        tiwan   10000
1  basmala   19     new york   20000
2     alaa   22        cairo   30000
3     rana   23  los angeles   45000
4   habiba   20         gaza   15000

Dropping Columns

In [36]:
df=df.drop('City',axis=1)
df

      Name  Age  Salary
0    reham   21   10000
1  basmala   19   20000
2     alaa   22   30000
3     rana   23   45000
4   habiba   20   15000

Dropping Rows

In [37]:
df=df.drop(0,axis=0)
df

      Name  Age  Salary
1  basmala   19   20000
2     alaa   22   30000
3     rana   23   45000
4   habiba   20   15000

Detecting Missing Values

In [38]:
df_with_nan=pd.DataFrame({'A':[1,2,None],'B':[4,None,6]})
print(df_with_nan.isnull())

       A      B
0  False  False
1  False   True
2   True  False

In [39]:
df_with_nan.isna()

       A      B
0  False  False
1  False   True
2   True  False

count the number of missing (NaN) values in each column of a DataFrame

In [40]:
df_with_nan.isnull().sum()

A    1
B    1
dtype: int64

count the number of missing (NaN) values of DataFrame

In [41]:
df_with_nan.isnull().sum().sum()

np.int64(2)

In [45]:
student_dict = {'Name': ['Joe', 'Ali','Baraa','Tala'], 'Age': [20,None,40, 35], 'Marks': [None,None,95,80]}
student_df = pd.DataFrame(student_dict,index=['a','b','c','d'])
student_df

    Name   Age  Marks
a    Joe  20.0    NaN
b    Ali   NaN    NaN
c  Baraa  40.0   95.0
d   Tala  35.0   80.0

This method replaces all NaN (missing) values in the DataFrame with 0.

In [46]:
student_df.fillna(0)

    Name   Age  Marks
a    Joe  20.0    0.0
b    Ali   0.0    0.0
c  Baraa  40.0   95.0
d   Tala  35.0   80.0

In [51]:
df_with_nan=pd.DataFrame({'A':[1,2,None],'B':[4,None,6]})
df_with_nan

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  6.0

This replaces all NaN values in column 'A' with the calculated mean.

In [52]:
df_with_nan['A']=df_with_nan['A'].fillna(df_with_nan['A'].mean())
df_with_nan

     A    B
0  1.0  4.0
1  2.0  NaN
2  1.5  6.0

This replaces all NaN values in column 'B' with the calculated mean.

In [53]:
df_with_nan['B']=df_with_nan['B'].fillna(df_with_nan['B'].mean())
df_with_nan

     A    B
0  1.0  4.0
1  2.0  5.0
2  1.5  6.0

In [54]:
student_dict = {'Name': ['Joe', 'Ali','Baraa','Tala'], 'Age': [20,None,40, 35], 'Marks': [None,None,95,80]}
student_df = pd.DataFrame(student_dict,index=['a','b','c','d'])
student_df

    Name   Age  Marks
a    Joe  20.0    NaN
b    Ali   NaN    NaN
c  Baraa  40.0   95.0
d   Tala  35.0   80.0

 calculates the mean (average) of the values in the 'Marks' column of the DataFrame student_df

In [55]:
student_df['Marks'].mean()

np.float64(87.5)

This replaces all NaN values in column 'Marks' with the calculated mean.

In [56]:
student_df['Marks'].fillna(student_df['Marks'].mean())

a    87.5
b    87.5
c    95.0
d    80.0
Name: Marks, dtype: float64

In [60]:
df_with_nan=pd.DataFrame({'A':[1,2,None],'B':[4,None,6]})
df_with_nan

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  6.0

Dropping Rows with Missing Values

In [59]:
cleaned_df=df_with_nan.dropna()
print(cleaned_df)

     A    B
0  1.0  4.0

Dropping Columns with Missing Values

In [61]:
cleaned_df=df_with_nan.dropna(axis=1)
print(cleaned_df)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [63]:
df = pd.DataFrame({'Department': ['HR', 'IT', 'HR', 'IT'],
                   'Salary': [50000, 60000, 45000, 80000]})
df

  Department  Salary
0         HR   50000
1         IT   60000
2         HR   45000
3         IT   80000

The code defines a function double_salary and applies it to the 'Salary' column of the DataFrame df to create a new column 'double_salary'

In [65]:
def double_salary(x):
    return x*2
df['double_salary']=df['Salary'].apply(double_salary)
df

  Department  Salary  double_salary
0         HR   50000         100000
1         IT   60000         120000
2         HR   45000          90000
3         IT   80000         160000

In [68]:
age_sex={'Age':[34.5,47.0,62.0,27.0,22.0],'Sex':['male','female','male','male','female']}
df_age_sex=pd.DataFrame(age_sex)
df_age_sex

    Age     Sex
0  34.5    male
1  47.0  female
2  62.0    male
3  27.0    male
4  22.0  female

The code defines a function Get_Gender_Bool and applies it to the 'Sex' column of the DataFrame df_age_sex to create a new column 'Bool_Male'

In [69]:
def Get_Gender_Bool(gender):
    if gender == "male":
        return 1
    else:
        return 0

df_age_sex["Bool_Male"] = df_age_sex.Sex.apply(Get_Gender_Bool)
df_age_sex

    Age     Sex  Bool_Male
0  34.5    male          1
1  47.0  female          0
2  62.0    male          1
3  27.0    male          1
4  22.0  female          0

The code groups the DataFrame df by the 'Department' column and calculates the mean of the 'Salary' column for each group

In [70]:
df = pd.DataFrame({'Department': ['HR', 'IT', 'HR', 'IT'],
                   'Salary': [50000, 60000, 45000, 80000]})
grouped = df.groupby('Department').mean()
print(grouped)

             Salary
Department
HR          47500.0
IT          70000.0

In [74]:
data = {
    "ID": [1, 2, 3, 4, 5],
    "Name": ["John Doe", "Jane Smith", "Bob Johnson", "Alice White", "Charlie Brown"],
    "Department": ["HR", "IT", "Finance", "IT", "Marketing"],
    "Age": [28, 34, 45, 29, 32],
    "Salary": [50000, 75000, 85000, 72000, 68000],
    "Joining_Date": ["2020-05-21", "2019-06-12", "2018-07-15", "2021-01-04", "2019-11-30"]
}
df=pd.DataFrame(data)
df

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

The code calculates the average salary for each department in the DataFrame df

In [75]:
average_salary_by_dept = df.groupby('Department')['Salary'].mean()
print("Average Salary by Department:\n")
average_salary_by_dept.head()

Average Salary by Department:

Department
Finance      85000.0
HR           50000.0
IT           73500.0
Marketing    68000.0
Name: Salary, dtype: float64